#+BEGIN_OPTIONS
#+AUTHOR: William F. Schneider
#+TITLE: CBE 60553 Homework
#+EMAIL: wschneider@nd.edu
#+LATEX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER:\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
#+LATEX_HEADER:\geometry{margin=1.0in}
#+LATEX_HEADER:\usepackage{hyperref}
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{graphicx}
#+LATEX_HEADER:\usepackage{epstopdf}
#+LATEX_HEADER:\usepackage{fancyhdr}
#+LATEX_HEADER:\pagestyle{fancy}
#+LATEX_HEADER:\fancyhf{}
#+LATEX_HEADER:\usepackage[labelfont=bf]{caption}
#+LATEX_HEADER:\usepackage{setspace}
#+LATEX_HEADER:\setlength{\headheight}{10.2pt}
#+LATEX_HEADER:\setlength{\headsep}{20pt}
#+LATEX_HEADER:\renewcommand{\headrulewidth}{0.5pt}
#+LATEX_HEADER:\renewcommand{\footrulewidth}{0.5pt}
#+LATEX_HEADER:\lfoot{\today}
#+LATEX_HEADER:\cfoot{\copyright\ 2017 W.\ F.\ Schneider}
#+LATEX_HEADER:\rfoot{\thepage}
#+LATEX_HEADER:\chead{\bf{Advanced Chemical Engineering Thermodynamics (CBE 60553)\vspace{12pt}}}
#+LATEX_HEADER:\lhead{\bf{Homework 6}}
#+LATEX_HEADER:\rhead{\bf{Due November 22, 2017}}
#+LATEX_HEADER:\usepackage{titlesec}
#+LATEX_HEADER:\titlespacing*{\section}
#+LATEX_HEADER:{0pt}{0.6\baselineskip}{0.2\baselineskip}
#+LATEX_HEADER:\title{University of Notre Dame\\Advanced Chemical Engineering Thermodynamics\\(CBE 60553)}
#+LATEX_HEADER:\author{Prof. William F.\ Schneider}
#+LATEX_HEADER:\usepackage{siunitx}
#+LATEX_HEADER:\usepackage[version=3]{mhchem}
#+LATEX_HEADER:\def\dbar{{\mathchar'26\mkern-12mu d}}

#+OPTIONS: toc:nil
#+OPTIONS: H:3 num:3
#+OPTIONS: ':t
#+END_OPTIONS

\noindent *Solve each problem on separate sheets of paper, and clearly indicate the problem number and your name on each.  Carefully and neatly document your answers.  You may use a mathematical solver like Matlab or Mathematica. Use plotting software for all plots.*

* Separating an ideal mixture
The exhaust from a coal-fired power plant contains approximately 12\% \ce{CO2} in a
  mixture of other gases, all at \SI{40}{\celsius} and \SI{1}{atm}.

1. What is the minimum work, in kJ/kg \ce{CO2}, to separate the \ce{CO2} from the
  remaining gases at constant $T$ and $P$, assuming the gas mixture is ideal?

2. What is the minimum work of separation if the mixture is non-ideal and obeys the
  Lewis-Randall mixing rules, $\hat{f}_i^{\text{mix}} = y_i f_i$?

\[
W_{min} = -\Delta G_{mix} = (N_A \mu_A(y_A,T) + N_B \mu_B(y_B,T)) - N_A \mu_A(T) - N_B \mu_B(T)
\]

#+BEGIN_SRC python :exports none
import numpy as np

R0 = 8.31441
T = 273.15 + 40
P = 101325       # Pascal

y = 0.12

amix = -R0 * T * (y*np.log(y) + (1-y)*np.log(1-y))

print('Question 1')
print('Ideal work =',amix,'J/mol mixture')
print('Ideal work =',amix*(1./0.12)*(1./0.032)*(1./1000.),'kJ/kg CO2')

print('Question 2')
print('Same answer. Non-ideal parts cancel')
#+END_SRC

#+RESULTS:
: Question 1
: ('Ideal work =', 955.34700234576258, 'J/mol mixture')
: ('Ideal work =', 248.78828186087568, 'kJ/kg CO2')
: Question 2
: Same answer. Non-ideal parts cancel

